[
    {
        "url": "https://codes.iccsafe.org/content/MNFC2020P1/copyright",
        "content": "Codes / Minnesota / 2020 Minnesota State Fire Code \nCopyright\n2020 Minnesota State Fire Code\nfavorite_border\n2018 IFC \n\nAmended\n\nEffective Date: Mar 31, 2020\n\nVersion: Mar 2020\nCONTENTS\nNOTES\n\n\n\n2020 Minnesota State Fire Code\n\n\n\n\n\n\n\nFirst Printing: March 2020\n\n\n\n\n\n\n\n\n\nISBN: 978-1-60983-989-5\n\n\n\n\n\n\n\nCOPYRIGHT © 2020\nby\nINTERNATIONAL CODE COUNCIL, INC.\n\n\n\n\n\n\n\n\n\n\n\nALL RIGHTS RESERVED. This 2020 Minnesota State Fire Code contains substantial material from the 2018 International Fire Code®, first printing, which is a copyrighted work owned by the International Code Council, Inc. (“ICC”). Without advance written permission from the copyright owner, no part of this book may be reproduced, distributed or transmitted in any form or by any means, including, without limitation, electronic, optical or mechanical means (by way of example, and not limitation, photocopying or recording by or in an information storage retrieval system). For information on use rights and permissions, please contact: ICC Publications, 4051 Flossmoor Road, Country Club Hills, IL 60478. Phone 1-888-ICC-SAFE (422-7233).\n\nTrademarks: “International Code Council,” the “International Code Council” logo, “ICC,” the “ICC” logo, “International Fire Code,” “IFC” and other names and trademarks appearing in this book are registered trademarks of the International Code Council, Inc., and/or its licensors (as applicable), and may not be used without permission.\n\n\n\n\n\n\n\n\n\nPRINTED IN THE USA\n\n\n\n\n\n\n\n\n\nSubscribe to the Building Safety Journal\n\nSubscribe\nICC Family of Solutions\nConnect With Us\nPrivacy Policy |\nTerms of Use |\nContact Us |\nAccessibility Policy\n\nCOPYRIGHT © 2025 INTERNATIONAL CODE COUNCIL, INC. ALL RIGHTS RESERVED."
    },
    {
        "url": "https://codes.iccsafe.org/content/MNFC2020P1/minnesota-department-of-public-safety-state-fire-marshal-division",
        "content": "Codes / Minnesota / 2020 Minnesota State Fire Code \nMinnesota Department of Public Safety State Fire Marshal Division\n2020 Minnesota State Fire Code\nfavorite_border\n2018 IFC \n\nAmended\n\nEffective Date: Mar 31, 2020\n\nVersion: Mar 2020\nCONTENTS\nNOTES\n\n\n\nMinnesota Department of Public Safety\n\nState Fire Marshal Division\n\n\n\n\n\n\n\n\nAdditional information on the Minnesota State Fire Code can be found at the\n\nMinnesota State Fire Marshal Division’s website: sfm.dps.mn.gov.\n\n\n\n\n\nThere you can find information sheets, policies, code interpretations, links to Minnesota Statutes and Rules, the online version\n\nof the fire code and other helpful information to assist you in using the Minnesota State Fire Code.\n\n\n\n\n\nMinnesota Rules material is published with the permission of the\n\nOffice of the Revisor of Statutes.\n\n\n\n\n\n\n\n\n\nSpecial thanks to the Minnesota State Fire Chiefs Association Code Committee\n\nfor their assistance in the development of this fire code.\n\nSubscribe to the Building Safety Journal\n\nSubscribe\nICC Family of Solutions\nConnect With Us\nPrivacy Policy |\nTerms of Use |\nContact Us |\nAccessibility Policy\n\nCOPYRIGHT © 2025 INTERNATIONAL CODE COUNCIL, INC. ALL RIGHTS RESERVED."
    },
    {
        "url": "https://codes.iccsafe.org/content/MNFC2020P1/important-disclaimer",
        "content": "Codes / Minnesota / 2020 Minnesota State Fire Code \nImportant Disclaimer\n2020 Minnesota State Fire Code\nfavorite_border\n2018 IFC \n\nAmended\n\nEffective Date: Mar 31, 2020\n\nVersion: Mar 2020\nCONTENTS\nNOTES\n\n\n\nImportant Disclaimer\n\nNote: Minnesota Rules included in this document have been extracted from Minnesota Rules 2016 and from Minnesota Rules proposed for adoption in 2020. Although efforts have been made to ensure the accuracy of the Minnesota Rules included herein, the official Minnesota Rules are as published by the Office of the Revisor of Statutes: https://www.revisor.mn.gov/rules/.\n\nIf there is a difference between the Minnesota Rules included herein and the official rules published by the Office of the Revisor of Statutes, the official rules published by the Office of the Revisor of Statutes take precedence.\n\nThe official rules published by the Office of the Revisor of Statutes must be used for any notice or legal documentation used in conjunction with the application or enforcement of the Minnesota State Fire Code.\n\nNeither the state of Minnesota nor its employees or agents make any representations or warranties, express or implied, with respect to the use or reliance on the information provided herein, and the user assumes all risks and responsibilities associated with its use.\n\nIn no event shall the state of Minnesota or its employees be liable for any direct, indirect, incidental, special, exemplary, or consequential damages arising in any way out of the use of this material.\n\nSubscribe to the Building Safety Journal\n\nSubscribe\nICC Family of Solutions\nConnect With Us\nPrivacy Policy |\nTerms of Use |\nContact Us |\nAccessibility Policy\n\nCOPYRIGHT © 2025 INTERNATIONAL CODE COUNCIL, INC. ALL RIGHTS RESERVED."
    }
]